In [5]:
import pandas as pd
#dataframe = pd.DataFrame()
venda = {'data':['15/01/2025','20/02/2025'],
         'valor':[500, 300],
         'produto':['feij達o','arroz'],
         'qtde':[50, 70]
         }
vendas_df = pd.DataFrame(venda)
print(vendas_df)

         data  valor produto  qtde
0  15/01/2025    500  feij達o    50
1  20/02/2025    300   arroz    70

In [9]:
display(vendas_df)

         data  valor produto  qtde
0  15/01/2025    500  feij達o    50
1  20/02/2025    300   arroz    70

In [19]:
import pandas as pd
vendas_df = pd.read_excel("teste1.xlsx")
display(vendas_df)

    Produto  Valor  Quantidade  Total       Data
0     Arroz     13           2     26 2025-02-04
1    Batata      4           2      8 2025-02-06
2     Carro  40000           1  40000 2025-02-20
3  Camiseta     40           3    120 2025-02-04

In [27]:
display(vendas_df.head())#mostra ate no maximo somente 5 primeiros valores
print(vendas_df.shape)# mostra quantas linhas e colunas tem na tabela
display(vendas_df.describe())# descreve os dados da tabela

    Produto  Valor  Quantidade  Total       Data
0     Arroz     13           2     26 2025-02-04
1    Batata      4           2      8 2025-02-06
2     Carro  40000           1  40000 2025-02-20
3  Camiseta     40           3    120 2025-02-04

(4, 5)

              Valor  Quantidade       Total                 Data
count      4.000000    4.000000      4.0000                    4
mean   10014.250000    2.000000  10038.5000  2025-02-08 12:00:00
min        4.000000    1.000000      8.0000  2025-02-04 00:00:00
25%       10.750000    1.750000     21.5000  2025-02-04 00:00:00
50%       26.500000    2.000000     73.0000  2025-02-05 00:00:00
75%    10030.000000    2.250000  10090.0000  2025-02-09 12:00:00
max    40000.000000    3.000000  40000.0000  2025-02-20 00:00:00
std    19990.505853    0.816497  19974.3937                  NaN

In [1]:
produtos = vendas_df[['Produto']]
display(produtos)

NameError: name 'vendas_df' is not defined